app/views/curriculums/_curriculum_course_fields.html.erb

SELECT `courses`.* FROM `courses`
---
  <%= f.label 'Curso' %>
  <%= f.collection_select(:course_id, Course.all, :id, :nome, {prompt: 'SELECIONE'}) %>