app/views/curriculums/_experience_fields.html.erb

  <%= f.label 'Profissão' %>
  <%= f.collection_select(:career_id, Career.all, :id, :nome, {prompt: 'SELECIONE'}) %>
---
SELECT `careers`.* FROM `careers`