app/views/curriculums/_form.html.erb

SELECT `languages`.* FROM `languages`
---

    <%= f.collection_check_boxes :language_ids, Language.all, :id, :nome do |lang| %>