app/views/curriculums/index.html.erb

SELECT `languages`.* FROM `languages` INNER JOIN `curriculum_languages` ON `languages`.`id` = `curriculum_languages`.`language_id` WHERE `curriculum_languages`.`curriculum_id` = 1
---
        <td><%= curriculum.id %></td>
        <td><%= curriculum.languages.map(&:nome).sort.join(", ") %></td>