app/views/curriculums/show.html.erb

		      <%# experiencia = Experience.find_by(curriculum_id: @curriculum_id) %>
		      <%= curr.experiences.map(&:empresa).sort.join(", ") %>
---
SELECT  `experiences`.* FROM `experiences` WHERE `experiences`.`curriculum_id` IS NULL LIMIT 1