app/controllers/careers_controller.rb

SELECT `careers`.* FROM `careers`
---
  def index
    @careers = Career.all

SELECT  `careers`.* FROM `careers` WHERE `careers`.`id` = 1 LIMIT 1
---
    def set_career
      @career = Career.find(params[:id])