app/controllers/curriculums_controller.rb

SELECT `curriculums`.* FROM `curriculums`
---
  def index
    @curriculums = Curriculum.all

SELECT `curriculums`.* FROM `curriculums`
SELECT  `experiences`.* FROM `experiences` WHERE `experiences`.`curriculum_id` IS NULL LIMIT 1
---
  def show
    @curriculums = Curriculum.all
    @experiencias = Experience.all

INSERT INTO `curriculums` (`cidade`, `endereco`, `telefone_resid`, `telefone_com`, `created_at`, `updated_at`) VALUES ('POA', 'RUA A', '3030-5059', '', '2017-10-23 19:17:22', '2017-10-23 19:17:22')
---
  def create
    @curriculum = Curriculum.new(curriculum_params)

    @experience = Experience.new(experience_params)
    @course = Course.new(course_params)

    @experiec

    respond_to do |format|
      if @curriculum.save

SELECT  `curriculums`.* FROM `curriculums` WHERE `curriculums`.`id` = 2 LIMIT 1
---
    def set_curriculum
      @curriculum = Curriculum.find(params[:id])